 ### Create a dataframe in pandas using list and series

#### create a data frame using list


list1 = ['I', 'Love', 'Data', 'Science']

In [1]:
import numpy as np
import pandas as pd
list1 = ['I', 'Love', 'Data', 'Science']
df = pd.DataFrame([list1])
df

   0     1     2        3
0  I  Love  Data  Science


#### create dataframe from Dictionary

city_state = {'Delhi': 'Delhi', 'Mumbai': 'Maharashtra', 'Kolkata': 'West Bengal', 'Banglore': 'Karnataka'}

In [10]:
# Write a code here
import numpy as np
import pandas as pd
city_state = {'Delhi': 'Delhi', 'Mumbai': 'Maharashtra', 'Kolkata': 'West Bengal', 'Banglore': 'Karnataka'}
#city_state2 = {'state':['Delhi', 'Maharashtra', 'West Bengal', 'Karnataka'],'city':['Delhi','Mumbai','Kolkata','Banglore']}
pd.DataFrame(city_state, index=['state'])
#pd.DataFrame(city_state2)

       Delhi       Mumbai      Kolkata   Banglore
state  Delhi  Maharashtra  West Bengal  Karnataka

In [11]:
import pandas as pd
import numpy as np
 
#Create a DataFrame
df1 = {
    'State':['Arizona AZ','Georgia GG','Newyork NY','Indiana IN','Florida FL'],
   'Score':[62,47,55,74,31]}
 
df1 = pd.DataFrame(df1,columns=['State','Score'])
print(df1)

        State  Score
0  Arizona AZ     62
1  Georgia GG     47
2  Newyork NY     55
3  Indiana IN     74
4  Florida FL     31

In [18]:
df1.iloc[::-1,:]

        State  Score
4  Florida FL     31
3  Indiana IN     74
2  Newyork NY     55
1  Georgia GG     47
0  Arizona AZ     62